{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "dtype": "float32", "data_format": "channels_last", "batch_input_shape": [null, 1, 5, 32, 4]}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "units": 16, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "units": 16, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "units": 16, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "trainable": true, "units": 4, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_4", "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_4"}}], "keras_version": "2.1.6"}