{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 1, 5, 32, 4], "data_format": "channels_last", "name": "flatten_1", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 16, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 16, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 16, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 4, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_4"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}