{"config": [{"config": {"batch_input_shape": [null, 1, 8], "dtype": "float32", "name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 16, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_2", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 16, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_3", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 16, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_4", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential"}