{"config": [{"config": {"trainable": true, "name": "flatten_1", "dtype": "float32", "batch_input_shape": [null, 1, 5, 32, 4], "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null, "units": 16, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "activity_regularizer": null, "units": 16, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "activity_regularizer": null, "units": 16, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "activity_regularizer": null, "units": 4, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "linear"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}